# 5- Updating Rows and Columns

Updating values inside of a DF is essential when working with pandas. Naturally there are a few ways in which you can update a DF, from changing the names of columns, to updating individual values in specified rows.

In [1]:
# Importing pandas
import pandas as pd

In [2]:
# Creating people DF
people_df = pd.DataFrame(
    {
        'first': ['John', 'Paul', 'George', 'Ringo'],
        'last': ['Lennon', 'McCartney', 'Harrison', 'Starr'],
        'birthyear': ['1940', '1942', '1943', '1940'],
        'email': [
            'john.lennon@email.com',
            'paul.mccartney@email.com',
            'george.harrison@email.com',
            'ringo.starr@email.com',
        ],
    }
)

## Updating column's names

You can use the `columns` attribute to find the names of the columns of the DF. This is also the way of updating these names, by simply assigning a list of the same length of the number of columns with names.

Instead of writing a list of column names each time you want to change the name of a single column, or even to make a slight change into all of these names, you can use two other tools. The first is a simple and very pythonic way, "**_list comprehension_**" is a way of condensing `for` loops with conditionals to create lists. Using list comprehensions is a basic way of solving this situation, since `.columns` takes a list, logically the list you assign this attribute can be built using list comprehension.

The other way is by using `.replace` and pass a dict with the names to be substituted and the names to substitute. To make changes permanent, much like other DF methods, set `inplace` to true.

In [3]:
# Checking the names of the columns
people_df.columns

Index(['first', 'last', 'birthyear', 'email'], dtype='object')

In [4]:
# Reassigning column names
people_df.columns = ['First_name', 'Last_name', 'Year_born', 'E_mail']
people_df

  First_name  Last_name Year_born                     E_mail
0       John     Lennon      1940      john.lennon@email.com
1       Paul  McCartney      1942   paul.mccartney@email.com
2     George   Harrison      1943  george.harrison@email.com
3      Ringo      Starr      1940      ringo.starr@email.com

In [5]:
# Turning all of the names to lowercase
people_df.columns = [x.lower() for x in people_df.columns]
people_df

  first_name  last_name year_born                     e_mail
0       John     Lennon      1940      john.lennon@email.com
1       Paul  McCartney      1942   paul.mccartney@email.com
2     George   Harrison      1943  george.harrison@email.com
3      Ringo      Starr      1940      ringo.starr@email.com

In [6]:
# Substituting names using rename method
people_df.rename(columns={'first_name': 'first', 'last_name': 'last'}, inplace=True)
people_df

    first       last year_born                     e_mail
0    John     Lennon      1940      john.lennon@email.com
1    Paul  McCartney      1942   paul.mccartney@email.com
2  George   Harrison      1943  george.harrison@email.com
3   Ringo      Starr      1940      ringo.starr@email.com

## Updating Rows

To update rows in a DF is not quite as simple as changing column's names, but its still very much straightforward. Firstly, much like updating column's names, we use lists to reassign values to a row, you also need to pass it a list updating all of the arguments if just accessing the row without specifying a column. You can also use list comprehensions here, but there are better ways to work with row updates. A big peculiarity of using a location method, is that you can specify the column(s) you want to update.

You can also use pandas `.at` instead of `.loc`, the difference being that `.at` only accesses one cell at a time.

In [7]:
# Updating first row
people_df.loc[0] = ['John', 'Smith', '1943', 'JohnSmith@email.com']
people_df

    first       last year_born                     e_mail
0    John      Smith      1943        JohnSmith@email.com
1    Paul  McCartney      1942   paul.mccartney@email.com
2  George   Harrison      1943  george.harrison@email.com
3   Ringo      Starr      1940      ringo.starr@email.com

In [8]:
# Updating last and email columns of first row
people_df.loc[0, ['last', 'e_mail']] = ['Lennon', 'john.lennon@email.com']
people_df

    first       last year_born                     e_mail
0    John     Lennon      1943      john.lennon@email.com
1    Paul  McCartney      1942   paul.mccartney@email.com
2  George   Harrison      1943  george.harrison@email.com
3   Ringo      Starr      1940      ringo.starr@email.com

In [9]:
# Using .at to update a cell
people_df.at[0, 'last'] = 'Doe'
people_df

    first       last year_born                     e_mail
0    John        Doe      1943      john.lennon@email.com
1    Paul  McCartney      1942   paul.mccartney@email.com
2  George   Harrison      1943  george.harrison@email.com
3   Ringo      Starr      1940      ringo.starr@email.com

In [10]:
# Trying to update a value by filtering a column
people_filter = people_df['e_mail'] == 'paul.mccartney@email.com'
people_df[people_filter]['last'] = 'Smith'

/var/folders/1k/k8m1yzxn29s9w7lp8l2mchfw0000gn/T/ipykernel_43806/333405297.py:3: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  people_df[people_filter]['last'] = 'Smith'

In [11]:
# Correctly using a filter to update a value
people_df.loc[people_filter, 'last'] = 'Smith'
people_df

    first      last year_born                     e_mail
0    John       Doe      1943      john.lennon@email.com
1    Paul     Smith      1942   paul.mccartney@email.com
2  George  Harrison      1943  george.harrison@email.com
3   Ringo     Starr      1940      ringo.starr@email.com

## `apply`, `applymap`, `map`, `replace`

There are a few ways of using a function to update a column. The simplest way of doing so, is applying a function to the column and reassigning it to its updated value.

This isn't very practical, this is why pandas has a few other ways of updating these values, by using the `apply`, `applymap`, `map`, and `replace`.

- `apply` is the simplest function of the lot to apply a function to a Series/DF. Just cal the apply method on the DF or Series and pass the function you wish to be applied to that structure as an argument. The thing about using `apply` is depending if you're using it on a Series or on a DF, the effects of the method is different. If used on a Series, the function is applied to each one of the cells in the Series, whereas when used on a DataFrame, it is applied over the Series that compose it. You can also apply the function on different axis (columns and rows).
- `applymap` applies a function to every individual cell on a DF (kind of what you would want to happen when using apply to a DF).
- `map` is a function that only works on Series, and its a way of substituting each value in a Series with any other value. Call the map function and pass it a dict with the values to be substituted. The peculiarity of this method is that values that aren't explicitly substituted are converted into `NaN`.
- `replace` works like `map`, but doesn't substitute values to `NaN`.

**_OBS.: `applymap` is a deprecated method and it should really be used, it's shown here for the sake of learning. Just don't really use it =)_**

In [12]:
# Updating the values of a column using a function and reassigning it
people_df['last'] = people_df['last'].str.lower()
people_df

    first      last year_born                     e_mail
0    John       doe      1943      john.lennon@email.com
1    Paul     smith      1942   paul.mccartney@email.com
2  George  harrison      1943  george.harrison@email.com
3   Ringo     starr      1940      ringo.starr@email.com

In [ ]:
# Using apply function to check len of e_mail values
people_df['e_mail'].apply(len)

0    21
1    24
2    25
3    21
Name: e_mail, dtype: int64

In [ ]:
# Using apply to reassign the values of email to upper
people_df['email'] = people_df['e_mail'].apply(lambda x: x.upper())
people_df

,first,last,year_born,e_mail,email
0,John,doe,1943,john.lennon@email.com,JOHN.LENNON@EMAIL.COM
1,Paul,smith,1942,paul.mccartney@email.com,PAUL.MCCARTNEY@EMAIL.COM
2,George,harrison,1943,george.harrison@email.com,GEORGE.HARRISON@EMAIL.COM
3,Ringo,starr,1940,ringo.starr@email.com,RINGO.STARR@EMAIL.COM

In [ ]:
# Using apply on a DF over columns (doesn't work as expected)
people_df.apply(len, axis='columns')

0    5
1    5
2    5
3    5
dtype: int64

In [ ]:
# Using apply on a DF (correctly applying)
people_df.apply(pd.Series.min)

first                           George
last                               doe
year_born                         1940
e_mail       george.harrison@email.com
email        GEORGE.HARRISON@EMAIL.COM
dtype: object

In [ ]:
# Using applymap to see length of each value in DF
people_df.applymap(len)

/var/folders/1k/k8m1yzxn29s9w7lp8l2mchfw0000gn/T/ipykernel_43806/4252434392.py:1: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.
  people_df.applymap(len)

   first  last  year_born  e_mail  email
0      4     3          4      21     21
1      4     5          4      24     24
2      6     8          4      25     25
3      5     5          4      21     21

In [ ]:
# Using map to change values in a DF
people_df['first'].map({'John': 'João', 'Paul': 'Paulo'})
people_df

,first,last,year_born,e_mail,email
0,John,doe,1943,john.lennon@email.com,JOHN.LENNON@EMAIL.COM
1,Paul,smith,1942,paul.mccartney@email.com,PAUL.MCCARTNEY@EMAIL.COM
2,George,harrison,1943,george.harrison@email.com,GEORGE.HARRISON@EMAIL.COM
3,Ringo,starr,1940,ringo.starr@email.com,RINGO.STARR@EMAIL.COM

In [ ]:
# Using replace to change values in a DF
people_df['first'] = people_df['first'].replace({'João': 'John', 'Paulo': 'Paul'})
people_df

,first,last,year_born,e_mail,email
0,John,doe,1943,john.lennon@email.com,JOHN.LENNON@EMAIL.COM
1,Paul,smith,1942,paul.mccartney@email.com,PAUL.MCCARTNEY@EMAIL.COM
2,George,harrison,1943,george.harrison@email.com,GEORGE.HARRISON@EMAIL.COM
3,Ringo,starr,1940,ringo.starr@email.com,RINGO.STARR@EMAIL.COM